[
  {
    "title": "A Brief History of Time",
    "author": "Stephen W. Hawking",
    "publisher": "Bantam Dell Pub Group",
    "publishdate": "September 1, 1998",
    "isbn": "978-0553380163",
    "pages": "256",
    "dateread": "December 15, 2005",
    "image": "http://images.barnesandnoble.com/images/1310000/1314148.gif",
    "notes": "An interesting book about space and...."
  },
  {
    "title": "Number Theory",
    "author": "George Andrews",
    "publisher": "Dover Pubns",
    "publishdate": "October 12, 1994",
    "isbn": "0486682528",
    "dateread": "March 2001",
    "image": "http://images.barnesandnoble.com/images/1280000/1281931.gif",
    "notes": "There's a little story about this book. I bought this book in Junior year of high school to try to pick up the pace on my math career. At that time, I had also been competing in the USA Math Talent Search sponsored by the NSA. I won a silver prize in this contest, which was a copy of this book I already owned. So I came in contact with them and they recommended another book for me. I also later went to get a job with them, but less on that later."
  },
  {
    "title": "How to Win Friends and Influence People",
    "author": "Dale Carnegie",
    "publisher": "Pocket",
    "publishdate": "February 1990",
    "isbn": "0671027034",
    "dateread": "August 2005",
    "image": "http://images.barnesandnoble.com/images/10750000/10754710.gif",
    "notes": "This was a gift from mom, I believe. It is my first book in a series of management/business book. In retrospect, I can't help but wonder if my intrigue for this book was ultimately responsible for my grad school choice."
  },
  {
    "title": "You Can Negotiate Anything",
    "author": "Herb Cohen",
    "publisher": "Bantam",
    "publishdate": "February 1989",
    "isbn": "0553281097",
    "dateread": "Apr 2005",
    "image": "http://images.barnesandnoble.com/images/7320000/7325691.gif",
    "notes": "This is my second book on the business wave. I thiought it was an interesting topic considering how comoditized the world is becoming."
  },
  {
    "title": "The Universe in a Nutshell",
    "author": "Stephen W. Hawking",
    "publisher": "Bantam",
    "publishdate": "October 2001",
    "isbn": "055380202X",
    "dateread": "May 2005",
    "image": "http://images.barnesandnoble.com/images/4280000/4284331.gif",
    "notes": "A classic. After reading this book, I just had to read further into physics on the macro and micro scale. I had a lot of questions after reading this book, which I had answered in the alt.physics.* newsgroups."
  },
  {
    "title": "The Science of God: The Convergence of Scientific and Biblical Wisdom",
    "author": "Gerald L. Schroeder",
    "publisher": "Broadway",
    "publishdate": "October 1998",
    "isbn": "076790303X",
    "dateread": "January 1999",
    "image": "http://images.barnesandnoble.com/images/1430000/1434595.gif",
    "notes": "I have no idea how I picked this book up, help anyone? It talks about specifics in the bible and shoehorns some of the ideas into now accepted scientific beliefs. I'm always interested in testing the faith of people that take their religion literally."
  },
  {
    "title": "Genome: The Autobiography of a Species in 23 Chapters",
    "author": "Matt Ridley",
    "publisher": "HarperCollins Publishers",
    "publishdate": "January 2000",
    "isbn": "0060194979",
    "pages": "344",
    "dateread": "March 2000",
    "image": "http://a1204.g.akamai.net/7/1204/1401/05101310011/images.barnesandnoble.com/images/10230000/10230951.jpg",
    "notes": "I picked this book up because the genome was a very hot topic in the day. It talks about some of the intricacies of DNA and the mechanics that cause mortality."
  },
  {
    "title": "Nothing in This Book Is True, But It's Exactly How Things Are: The Esoteric Meaning of the Monuments on Mars",
    "author": "Bob Frissell, Brett Lilly",
    "publisher": "Frog, Ltd.",
    "publishdate": "July 1994",
    "isbn": "1883319013",
    "pages": "230",
    "dateread": "July 1999",
    "image": "http://images.barnesandnoble.com/images/3080000/3086969.gif",
    "notes": "Light reading, to say the least"
  },
  {
    "title": "A New Kind of Science",
    "author": "Stephen Wolfram",
    "publisher": "Wolfram Media, Incorporated",
    "publishdate": "May 2002",
    "isbn": "1579550088",
    "pages": "1196",
    "dateread": "August 2004",
    "image": "http://a1204.g.akamai.net/7/1204/1401/04110908011/images.barnesandnoble.com/images/8530000/8539954.jpg",
    "notes": "Where to start? Here, Wolfram notices a pattern in the sciences. Specifically, his thesis is that throughout biology, computing, physics, weather and other sciences, there are behaviors that are considered complex and that these complex behaviors can be modeled by using simple models in large scales. One telling example is when he models fluid dynamics, a field generally dominated by differential equations, with a simple bouncing particles approach. I'm not going to lie, I was upset to read 70% through the book and find that the book ended with 200 pages remaining of notes and bibliography. It will take a while for the effects of the methods created in this book to be seen."
  },
  {
    "title": "The User Illusion: Cutting Consciousness Down to Size",
    "author": "Tor Nørretranders",
    "publisher": "Penguin",
    "publishdate": "21 August 1999",
    "isbn": "0140230122",
    "dateread": "June 2001",
    "pages": "480",
    "image": "http://ec3.images-amazon.com/images/P/0140230122.01._BO2,204,203,200_PIsitb-dp-500-arrow,TopRight,45,-64_AA240_SH20_SCLZZZZZZZ_.jpg",
    "notes": "Awesome fucking book! I bought this at a used book sale near in Philly, and I scooped this gem up on a whim. It talks about how specifically the mind works. This has huge implications for free will, religion, understanding sleep, philosophy/existentialism. I often use the ideas in this book when discussing any of these topics."
  },
  {
    "title": "The Broker",
    "author": "John Grisham",
    "publisher": "Dell",
    "publishdate": "January 11, 2005",
    "isbn": "0440241588",
    "pages": "432",
    "dateread": "August 2005",
    "image": "http://images.amazon.com/images/P/0739316478.01._AA240_SCLZZZZZZZ_.jpg",
    "notes": "This is the first fiction book I've ever read, recommended by my Uncle. In school I've always avoided reading fiction, and this day I decided I'm going to try it. Utter disapointment. I read past the end of the cover looking for action in this book. The story involved a chase, that's about it. As some might say, teh lame."
  },
  {
    "title": "The Da Vinci Code",
    "author": "Dan Brown",
    "publisher": "Anchor",
    "publishdate": "March 28, 2006",
    "isbn": "1400079179",
    "dateread": "April 2006",
    "image": "http://ec3.images-amazon.com/images/P/1400079179.01._BO2,204,203,200_PIsitb-dp-500-arrow,TopRight,45,-64_AA240_SH20_SCLZZZZZZZ_V51160144_.jpg",
    "notes": "My second fiction book, hoping not to get burned again, I came across this popular piece. More than a couple people recommended this book, and I anticipated a big hit since it is based on a code and apparently there's a big twist. What I liked were the bite sized chapters and a couple of the foreshadowing hooks. Other than that the story is hardly noteworthy, another waste of my time. Brown clearly capitalizes on the inquisitive public and skepticism of the Catholic church. The \"big twist\", was hardly worth reading up to, aside from the massive plot hole. I do laud the attempt to bring some historically buried facts into light, though."
  },
  {
    "title": "Prime Numbers: A Computational Perspective",
    "author": "Richard Crandall, Carl Pomerance",
    "publisher": "Springer",
    "publishdate": "2001",
    "isbn": "0387252827",
    "dateread": "September 2002",
    "image": "http://ec3.images-amazon.com/images/P/0387252827.01._BO2,204,203,200_PIsitb-dp-500-arrow,TopRight,45,-64_AA240_SH20_SCLZZZZZZZ_.jpg",
    "notes": "You can see elsewhere on this page how I came upon this book. It is a great way to hit the ground running towards the most sought after prize in cryptography (and therefore many other fields)."
  },
  {
    "title": "The World Is Flat: A brief history of the twenty-first century",
    "author": "Thomas L. Friedman",
    "publisher": "Farrar, Straus and Giroux",
    "publishdate": "April 18, 2006",
    "pages": "608",
    "isbn": "0374292795",
    "dateread": "May 2006",
    "image": "http://ec1.images-amazon.com/images/P/0374292795.01._BO2,204,203,200_PIsitb-dp-500-arrow,TopRight,45,-64_AA240_SH20_OU01_SCLZZZZZZZ_.jpg",
    "notes": "A very interesting look at the effects of many globalizing forces currently in play. There are many good examples in here that I can use in my discussions, which were all big surprises when I read them. It also discusses the way that developed peoples work with undeveloped peoples and how we can work together to take advantage of our new ability to communicate."
  },
  {
    "title": "Winning",
    "author": "Jack Welch, Suzy Welch",
    "publisher": "Collins",
    "publishdate": "August 5, 2005",
    "pages": "384",
    "isbn": "0060753943",
    "dateread": "June 2006",
    "image": "http://ec1.images-amazon.com/images/P/0060753943.01._BO2,204,203,200_PIsitb-dp-500-arrow,TopRight,45,-64_AA240_SH20_OU01_SCLZZZZZZZ_.jpg",
    "notes": "A very interesting and detailed look at a flat strategy for running an organization."
  },
  {
    "title": "Fortune's Formula: The Untold Story of the Scientific Betting System That Beat the Casinos and Wall Street",
    "author": "William Poundstone",
    "publisher": "Hill and Wang",
    "publishdate": "August 25, 2005",
    "pages": "400",
    "isbn": "0809046377",
    "dateread": "June 2006",
    "image": "http://ec3.images-amazon.com/images/P/0809046377.01._BO2,204,203,200_PIsitb-dp-500-arrow,TopRight,45,-64_AA240_SH20_OU01_SCLZZZZZZZ_.jpg",
    "notes": "First, this book goes into the biographies of several key players in gaming theory and its implementation. I was surprised that I already knew some of these people from Engineering, but had no idea of their other involvements. Then there is an explanation of the theories and formulas that allow optimal gaming. Last, it goes into their attempts to take advantage of these strategies in the real world. I couldn't put this one down and I learned lot. Although the overtone is discouraging, it still motivates me to find something simple to take advantage of."
  },
  {
    "title": "Three Billion New Capitalists: The Great Shift of Wealth and Power to the East",
    "author": "Clyde Prestowitz",
    "publisher": "Basic Books",
    "publishdate": "May 3, 2005",
    "pages": "321",
    "isbn": "0465062814",
    "dateread": "July 2006",
    "notes": "The author of this book is truly in a position to offer an experienced opinion on international trade. The book discusses the current dynamics of international trade and gives a practical perspective of economics, trade and politics. He explains the emerging practices of places he has travelled and offers insight from the perspective of each world power."
  },
  {
    "title": "Creating Teams With an Edge: The Complete Skill Set to Build Powerful and Influential Teams",
    "author": "Harvard Business School Press",
    "publisher": "Harvard Business School Press ",
    "publishdate": "March 31, 2004",
    "pages": "192",
    "isbn": "159139290X",
    "dateread": "May 2006",
    "image": "http://ec1.images-amazon.com/images/P/159139290X.01._BO2,204,203,200_PIsitb-dp-500-arrow,TopRight,45,-64_AA240_SH20_OU01_SCLZZZZZZZ_.jpg",
    "notes": "Explains the best practices for organizing and leading teams. Sadly, I didn't know what a team was until this book explained how it is different from a workgroup. Just to spoil the first page for you, a workgroup is a set of people reporting to a boss, but a team is an autonomous group having its own leadership and division of work. The benefits of a team structure are: less overhead, no single point of failure, more collaboration, and more buy-in."
  },
  {
    "title": "When Genius Failed: The Rise and Fall of Long-Term Capital Management",
    "author": "Roger Lowestein",
    "publisher": "Random House",
    "publishdate": "October 9, 2001",
    "pages": "288",
    "isbn": "0375758259",
    "dateread": "November 2006",
    "notes": "This was a good follow-up to reading about Long-Term in Fortune's Formula. One of the few history books I've ever enjoyed, this explains of the biggest financial ruts a company has caused. There is enough in-depth material so that you can gain a better appreciation of exactly what decisions were being made and how they affected the company and the economy as a whole."
  },
  {
    "title": "Blink: The Power of Thinking Without Thinking",
    "author": "Malcolm Gladwell",
    "publisher": "Little, Brown and Company",
    "publishdate": "January 11, 2005",
    "pages": "288",
    "isbn": "0316172324",
    "dateread": "October 2006",
    "image": "http://ec2.images-amazon.com/images/P/0316172324.01._BO2,204,203,200_PIsitb-dp-500-arrow,TopRight,45,-64_AA240_SH20_OU01_SCLZZZZZZZ_.jpg",
    "notes": "I borrowed this from a classmate and it worked out very well. I generally enjoy books having some psychological element. I plan on continuing with his other popular book."
  },
  {
    "title": "The Art of the Deal",
    "author": "Donald Trump",
    "publisher": "Random House",
    "pages": "256",
    "publishdate": "1987",
    "isbn": "0394555287",
    "dateread": "November 2006",
    "image": "http://ec1.images-amazon.com/images/P/0394555287.01._BO2,204,203,200_PIsitb-dp-500-arrow,TopRight,45,-64_AA240_SH20_OU01_SCLZZZZZZZ_.jpg",
    "notes": "An interesting read of how Trump was able to make big things happen. One of his main points is that you should not be personally accountable for transactions and that when you are making big deals that you can add contingencies to the contract if you are unable to assume certain large risks."
  },
  {
    "title": "The Tipping Point: How Little Things Can Make a Big Difference",
    "author": "Malcolm Gladwell",
    "publisher": "Back Bay Books",
    "publishdate": "January 7, 2002",
    "isbn": "0316346624",
    "pages": "304",
    "dateread": "September 2006",
    "image": "http://images.amazon.com/images/P/0316346624._BO2,204,203,200_THUMBZZZ_.jpg",
    "notes": "Good stuff. Talks about the causes and effects of macro events, and even dives into psychology. Written with many illustrative examples."
  },
  {
    "title": "The (Mis) Behavior of Markets: A Fractal View of Risk, Ruin And Reward",
    "author": "Benoit Mandelbrot",
    "publisher": "Perseus Books Group",
    "publishdate": "March 31, 2006",
    "isbn": "0465043577",
    "pages": "328",
    "dateread": "December 2006",
    "notes": "This book was a gift from a certain holiday at the end of the year. There is an analysis of patterns in financial markets. It was a well-anticipated read from an interesting author I recognize from my math background. Unfortunately, I find no depth to his arguments and see no use in reading about these ideas when they fail to make any measurable application to the real world. "
  },
  {
    "title": "The Essays of Warren Buffett : Lessons for Corporate America",
    "author": "Warren E. Buffett",
    "publisher": "The Cunningham Group",
    "isbn": "0966446119",
    "pages": "256",
    "dateread": "January 2007",
    "notes": "This book was a gift from a certain holiday at the end of the year. I enjoyed reading every page of it. This book included excerpts written entirely by Warren Buffett and released in his annual reports of Berkshire Hathaway. This is a very interesting company and through the annual reports, Buffett is able to distribute a great wealth of business knowledge. This book is well-compiled and does a good job of separating the excerpts by topic."
  },
  {
    "title": "Animal Farm",
    "author": "George Orwell",
    "publisher": "Secker and Warburg",
    "publishdate": "17 August 1945",
    "isbn": "0395796776",
    "pages": "112",
    "dateread": "June 2006",
    "notes": "This book was a gift from graduation from Villanova. I though it was well written an interesting, but the political and historical references were lost on me."
  },
  {
    "title": "1984",
    "author": "George Orwell",
    "publisher": "Secker and Warburg",
    "publishdate": "8 June 1949",
    "isbn": "0452284236",
    "pages": "368",
    "dateread": "January 2007",
    "notes": "Excellent book. Probably gets the award for best fiction from me, but I still need to spend time thinking about what happens in it. There are elements of politics, minor twists, torture, psychology. This is what fiction was made for!"
  },
  {
    "title": "The Real Deal: My Life in Business and Philanthropy",
    "author": "Sandy Weill",
    "publisher": "Hachette",
    "publishdate": "October 2006",
    "isbn": "0446578142",
    "pages": "530",
    "dateread": "March 2007",
    "notes": "This book talks about an interesting person who has been very successful in the securities industry. However this book leaves much to be desired. I'll start by tossing out a word that does not describe what is in the book: insightful. After reading the wonderful works of Buffet, you realize this book keeps all business knowledge close to the chest. The only person who should benefit from reading from this book would be a person already familiar with Weill on a personal level. Maybe a quote (the first one) from the rear jacket would illustrate this: \"I've been friends with Sandy Weill for nearly thirty years, and this book is vintage Sandy: at every turn it's spirited, passionate, and brutally honest\" (President Gerald Ford)."
  },
  {
    "title": "The FairTax Book: Saying Goodbye to the Income Tax and the IRS",
    "author": "Neal Boortz, John Linder",
    "publisher": "HarperCollins",
    "publishdate": "2006",
    "isbn": "0060875496",
    "pages": "188",
    "dateread": "March 2007",
    "notes": "This book describes a new taxation system that is based solely on consumption. An interesting concept, this is quite different from what I'm used to. There are several points in the book where I was upset because the arguments were weak. For example, they explain that this new system will still charge you the same amount in taxes, but they keep saying how high taxes are the issue when talking about the current system. I do, however think the idea is worth considering. And the notion of pre-bates is novel."
  },
  {
    "title": "The End of Faith: Religion, Terror, and the Future of Reason",
    "author": "Sam Harris",
    "publisher": "W. W. Norton and Co.",
    "publishdate": "October 10, 2005",
    "isbn": "0393327655",
    "pages": "224",
    "dateread": "April 2007",
    "notes": "The main idea here is that if we keep treating each other as less than equals (saying some are damned and others are saved) this will lead to mutual destruction due to nuclear proliferation. One profound device I found in here was a line of reasoning that shows how even religious moderates are responsible for this problem. There are also a nice set of moral evaluation tools in here that let you evaluate situations. These ultimately showed me that a few of my beliefs were inconsistent. While reading, some ideas seemed in line with something I read before. A quick flip to the bibliography confirmed that my boy Tor Nørretranders influenced these thoughts."
  },
  {
    "title": "Winning: The Answers",
    "author": "Jack Welsh, Suzy Welsh",
    "publisher": "Collins",
    "publishdate": "October 31, 2006",
    "isbn": "0061241490",
    "pages": "272",
    "dateread": "April 2007",
    "notes": "This is the follow up to Winning, by the same authors. The format is question and answer, with questions coming from audience members of the speaking tour Jack and Suzy went on. The book is valuable because it shows the path to implementing the values the original book taught. Many of the questions are particularly relevant to someone like me, who is just getting started in the game."
  },
  {
    "title": "Letter to a Christian nation",
    "author": "Sam Harris",
    "publisher": "Knopf",
    "publishdate": "September 19, 2006",
    "isbn": "0307265773",
    "pages": "96",
    "dateread": "April 2007",
    "notes": "This is the follow up to The End of Faith by the same author. While this book was worthless for me to read since it contained no original thoughts since the unabridged version, the included sections will be most relevant for some people. The target audience is someone who has dogmatic beliefs in Christianity, and I think the arguments will be most compelling to someone of that persuasion."
  },
  {
    "title": "The Long Tail: Why the Future of Business is Selling Less of More",
    "author": "Chris Anderson",
    "publisher": "Hyperion",
    "publishdate": "July 11, 2006",
    "isbn": "1401302378",
    "pages": "256",
    "dateread": "April 2006",
    "notes": "This book was written by the editor of Wired magazine and includes insight derived from many rounds of writing columns and giving speeches. Markets have changed lately because of the reducing costs of storage and shipping. Ultimately, this produces more choice for consumers. This book argues that customers have a large demand for choice and that they will be the driving force for the change from mainstream media to subculture media. The book is filled with graphs and graced with conclusions from proprietary consumer data."
  },
  {
    "title": "Thinking Strategically: The Competitive Edge in Business, Politics, and Everyday Life",
    "author": "Avinash K. Dixit, Barry J. Nalebuff",
    "publisher": "W. W. Norton & Company",
    "publishdate": "April 1993",
    "isbn": "0393310353",
    "pages": "408",
    "dateread": "May 2007",
    "notes": "I picked up this book as a suggested reading from my managing technology class. It has many practical situations in diverse fields where strategic thinking can be applied. There are a few basic tools of strategy that are introduced and there are many examples of how to use them. An excellent introduction to game theory and decision making. I did however disagree with their price negotiating strategy for joint ventures, and will have to look into that. There was also a citation in there from Herb Cohen's book I read earlier."
  },
  {
    "title": "The God Delusion",
    "author": "Richard Dawkins",
    "publisher": "Houghton Mifflin",
    "publishdate": "September 18, 2006",
    "isbn": "0618680004",
    "pages": "416",
    "dateread": "May 2007",
    "notes": "Makes many arguments against religion on the basis of rational argument and them explains the physiological and psychological reasons people have for being deluded. There are some interesting theories in terms of why people are deluded again and again. There are also some interesting moral tools and arguments that religion is strictly separate from morality. Some of the arguments against a deity are long winded of little use for quoting to the general public. The other insights provide many takeaways."
  },
  {
    "title": "The White Man's Burden: Why the West's Efforts to Aid the Rest Have Done So Much Ill and So Little Good",
    "author": "William Easterly",
    "publisher": "Penguin",
    "publishdate": "February 27, 2007",
    "isbn": "0143038826",
    "pages": "448",
    "dateread": "May 2007",
    "notes": "I picked this up merely because I knew nothing of the topic. The main argument is that giving money in foreign aid to countries for causes which the people don't think is bad. Since their government will become corrupt to game the system, this results in people being worse off than they were before the foreign aid. The solution is to promote causes that the people think are important and to monitor and hold accountable the agencies that intend to solve specific problems. There were a lot of good arguments in the book and I have come to agree with the thesis. (Older and wiser, a note from 3/25/2009: Human aid is a big task, gifting money and resources is not scalable, private enterprise is scalable, therefore private enterprise is the appropriate format to effect human aid.)"
  },
  {
    "title": "Future, Inc.: How Businesses Can Anticipate and Profit from What's Next",
    "author": "Eric Garland",
    "publisher": "AMACOM/American Management Association",
    "publishdate": "January 2007",
    "isbn": "0814408974",
    "pages": "264",
    "dateread": "May 2007",
    "notes": "This book includes a practical set of tools to use in analyzing trends affecting your industry. There is a case study of how to apply certain trends to a specific industry. There are details on big trends that have an impact on most every futures analysis. And lastly, is practical advice on how to present your findings to peers in a relevant and appropriate discussion."
  },
  {
    "title": "I am a Strange Loop",
    "author": "Douglas Hofstadter",
    "publisher": "Basic Books",
    "publishdate": "March 2007",
    "isbn": "0465030785",
    "pages": "412",
    "dateread": "June 2007",
    "notes": "This books entertains several philosophical debates and raises questions of what one's self really is. The format of this book was a little rough, with its made up words and occasional silliness. His main claim is that introspection can be recursive, due to the symbolic/material duality of perceptions in one's mind. What I gained most from this book is a map of more topic that I must learn about. It is interesting how many mathematicians are so interested in consciousness."
  },
  {
    "title": "Competing on Analytics: The New Science of Winning",
    "author": "Thomas H. Davenport, Jeanne G. Harris",
    "publisher": "Harvard Business School Press",
    "publishdate": "March 2007",
    "isbn": "1422103323",
    "pages": "218",
    "dateread": "July 2007",
    "notes": "This book is a great in-depth look at the models and processes that run the analytical world today. Using analytics properly can allow organizations to be very effective. It also looks at the process for bringing an organization into the proper mindset to accept change and how results from analytics can be demonstrated."
  },
  {
    "title": "Off the Record: The Press, the Government, and the War over Anonymous Sources",
    "author": "Norman Pearlstine",
    "publisher": "Farrar, Straus and Giroux",
    "publishdate": "June 26, 2007",
    "isbn": "0374224498",
    "pages": "304",
    "dateread": "June 2007",
    "notes": "This is a great look into the story of the White House leak about Joseph Wilson. It is written by the editor in chief of Time and shows the reader the important aspects of journalism with regards to confidentiality. This was a very interesting circumstance where politics, morals and confidentiality all came clashing together."
  },
  {
    "title": "The Definitive Book of Body Language",
    "author": "Barbara Pease, Allan Pease",
    "publisher": "Bantam",
    "publishdate": "July 25, 2006",
    "isbn": "0553804723",
    "pages": "400",
    "dateread": "July 2007",
    "notes": "This was a light interpretation of human physiology. It cited many behaviors we take for granted and analyzed them from a darwinian perspective. My original motivation for getting this book was my trip abroad coming several months after, to learn about the different cultures and customs in the places I will be visiting."
  },
  {
    "title": "The Late Great U.S.A.: The Coming Merger With Mexico and Canada",
    "author": "Jerome R. Corsi",
    "publisher": "WND Books",
    "publishdate": "July 4, 2007",
    "isbn": "0979045142",
    "pages": "241",
    "dateread": "August 2007",
    "notes": "This is a book written by a strong protectionist. The book focuses on joint press conferences of the United States, Mexico and Canada which are advancing the agenda of private leaders. At issue are the continuation of the SPP and several infrastructure projects. Our situation is compared to the European Union. It makes a strong case that several initiatives can be construed to lead our continent the way of the EU. However, the reasoning in the book sometimes makes the assumption that America is attempting to negotiate deals to its own detriment."
  },
  {
    "title": "The Black Swan: The Impact of the Highly Improbable",
    "author": "Nassim Nicholas Taleb",
    "publisher": "Random House",
    "publishdate": "April 17, 2007",
    "isbn": "1400063515",
    "pages": "400",
    "dateread": "August 2007",
    "notes": "This is an interesting look into human psychology. It describes how we look into a world of chaos and presume that things are orderly. We are therefore acting irrationally. This describes the problem, and how we can correct this error. This book has a finance tone, and there is practical advice that you can apply to your own decisions in life. It is also very accessible and provides laymen scenarios where you can see people acting with their erroneous logic."
  },
  {
    "title": "The Art of War",
    "author": "Sun Tzu, Thomas Cleary",
    "publisher": "Shambhala",
    "publishdate": "January 11, 2005",
    "isbn": "1590302257",
    "pages": "224",
    "dateread": "July 2007",
    "notes": "I never read this in school, and now was the time to catch up. Kurokawa recommended this book in our management of technology course. All of the information is timeless and can be interpreted relative to the situations you face in life (some will require more creative interpretation than others). It is best suited for adaptation to adversarial situations. It discusses many facets of strategy and attack, and even goes into advice on team morale."
  },
  {
    "title": "The Age of Turbulence: Adventures in a New World",
    "author": "Alan Greenspan",
    "publisher": "Penguin Press HC",
    "publishdate": "September 17, 2007",
    "isbn": "1594201315",
    "pages": "544",
    "dateread": "October 2007",
    "notes": "For a book that makes a lot a predictions, this has one advantage: Greenspan's voice moves the markets. This book discusses the many dynamics in play today, and then draws predictions for what is in store for the future. We'll all have a good laugh over this book in a few years."
  },
  {
    "title": "A Mathematician Plays The Stock Market",
    "author": "John Allen Paulos",
    "publisher": "Basic Books",
    "publishdate": "May 4, 2004",
    "isbn": "0465054811",
    "pages": "216",
    "dateread": "November 2007",
    "notes": "A better title would be: \"Compulsive gambler loses money.\" In the beginning, he whines compulsively about how he lost money on WorldCom, there is zero value in all his words on this. Unfortunately, I have read several books by mathematicians and they are all identical. I will save you the time of reading this or any other of them: fibonacci has a series of numbers, things get large when you exponentiate, adjacent spirals on a sunflower have sizes that are proportional at a ratio called phi. Like other \"math people\" books, this one butchers mathematical ideas by trying to make them accessible to a larger audience. Mathematics is a system of patterns and analogies. People that have these models in their repertoire can use them to understand new things. However it is useless to make these obscure analogies accessible to lay people; it would be better to describe new ideas directly. A person with a background in math will enjoy a good laugh on how he shoehorns Wolfram's cellular automata to describing investor sentiments (pp170-171). You can read it by searching for \"stephen wolfram\" of the \"Search Inside this book\" feature on Amazon. (Older and wiser, a note from 3/25/2009: The counter point to the author, who expects uninteresting results in the future, is simply to read Black Swan -- also on this list. Another note, the only useful sentence in this book, which is basically a footnote is wedged between pages 182-183.)"
  },
  {
    "title": "Good to Great: Why Some Companies Make the Leap... and Others Don't",
    "author": "Jim Collins",
    "publisher": "Collins",
    "publishdate": "October 16, 2001",
    "isbn": "0066620996",
    "pages": "300",
    "dateread": "November 2007",
    "notes": "This is an interesting analysis into best practices for businesses. It started as an academic exercise by using facts discovered during research. As the book goes on, it continues by including ideas that were not from the data, but the author felt should be included. Aside from this error, the book does have a consistent and, I feel, authentic tone. The main take aways were that you should focus on long term results and focus on your competencies. It goes on to discuss leadership qualities that are necessary for an organizational transformation."
  },
  {
    "title": "Blue Ocean Strategy: How to Create Uncontested Market Space and Make Competition Irrelevant",
    "author": "W. Chan Kim, Renee Mauborgne",
    "publisher": "Harvard Business School Press",
    "publishdate": "February 3, 2005",
    "isbn": "1591396190",
    "pages": "256",
    "dateread": "December 2007",
    "notes": "..."
  },
  {
    "title": "Greenspan's Bubbles: The Age of Ignorance at the Federal Reserve",
    "author": "William Fleckenstein, Fred Sheehan",
    "publisher": "McGraw-Hill",
    "publishdate": "January 16, 2008",
    "isbn": "0071591583",
    "pages": "208",
    "dateread": "June 2008",
    "notes": "This book makes the point that Greenspan has done America a disservice by consistently setting the Federal Funds Rate too low. The effect was that too much money was being deployed and bubbles formed. My favorite Volcker quote is in there: the fate of the world economy is now fully dependent on the growth of the U.S. economy, which is dependent on the stock market, whose growth is dependent on about 50 stocks, half of which have never reported on earnings. This book also makes some misleading uses of number like this: \"... was an annualized rate of 44 percent over the last 10 weeks of the year.\" For comparison, the S and P 500 went down an annualized 99.98% over the past day, (August 7, 2008). So overall what it comes down to is: did we over allocate resources to tech stocks from 1998-2001. As you answer this, you should look at a graph of the NASDAQ from 1990 to 2010. My answer is maybe a little bit, but not that much. When you think of how your life has changed during 1999 and 2000 as a result of the internet, I think it's quite reasonable to say \"this is the point when everything changed.\" And if you are going to misallocate capital, that is the perfect time to. However, after 2001 I agree with the author that money was too available, which resulted in a real estate and commodity bubble afterwards -- which was completely unfounded and delayed a much needed recession. (Older and wiser, a note from 4/14/2009: Of course, the solution is that interest rates should not be centrally planned.)"
  },
  {
    "title": "High Tech Start Up",
    "author": "John L. Nesheim",
    "publisher": "The Free Press",
    "publishdate": "March 16, 2000",
    "isbn": "068487170X",
    "pages": "342",
    "dateread": "October 2008",
    "notes": "I suppose reading a book titled \"High Tech Start Up\" from 2000 might lack an element of history that more recent books may have. Nevertheless, this book was recommended to me by Ron Blankenhorn as still relevant, and I trust his opinion. This book discuses the mechanics of successfully starting and eventually selling a high tech business. Quick fact: being the CEO of a high tech startup is less tiring than running a growing division at a large, public company. The book thoroughly discusses business plans and projection. Of course it boils down to the same lesson in business school: accounting numbers are useless, only cash matters. Another interesting thing about the book is that it discusses the relationships between all the parties, investors, VCs, management, lawyers, landlords, and it explains all the gotchas in dealing with those parties. Highly recommended for someone making deals, or starting a company."
  },
  {
    "title": "Harvard Business Review on Mergers and Acquisitions",
    "author": "Dennis Carey, Robert J. Aiello, Michael D. Watkins, Robert G. Eccles, Alfred Rappaport",
    "publisher": "Harvard Business School Press",
    "publishdate": "May 2001",
    "isbn": "1578515556",
    "pages": "224",
    "dateread": "November 2008",
    "notes": "This book was recommended by my boss. Notable topics include pricing acquisitions, swindling target shareholders with cash/shares offers, and integration phases."
  },
  {
    "title": "Venture Capital Investing: The Complete Handbook for Investing in Small Private Businesses for Outstanding Profits",
    "author": "David Gladstone",
    "publisher": "Financial Times/Prentice Hall",
    "publishdate": "December 1987",
    "isbn": "0139414282",
    "pages": "400",
    "dateread": "December 2008",
    "notes": "Another book recommended by my boss. My takeaways from this book include: how to prepare corporate reports for an external entity, and details about cost accounting. The best part of the book is Appendix 1, which has a list of sample questions is a dialog between an entrepreneur and venture capitalist. Also included are sample legal documents to officiate the relationship."
  },
  {
    "title": "Crash Proof: How to Profit From the Coming Economic Collapse",
    "author": "Peter D. Schiff, John Downes ",
    "publisher": "Wiley",
    "publishdate": "February 26, 2007",
    "isbn": "0470043601",
    "pages": "288",
    "dateread": "October 2008",
    "notes": "Peter Schiff is a permabull and makes predictions about collapse of the U.S. Dollar and U.S. markets, which will be decoupled from the rest of the world. The prose in his book and radio show is very argumentative and defensive, I am generally suspicious of these types of people. Some themes from the book are: U.S. GDP data is grossly inflated, a housing bubble will soon collapse, and America is way over-leveraged. The most valuable part of this book is an illustration of civil unrest in America, and a very skeptical view of government. These aspects are all useful. Peter's forecast on the specific path of America's economic downturn seems unlikely to happen within the next 5 years, but the book is still useful."
  },
  {
    "title": "The Israel Lobby and U.S. Foreign Policy",
    "author": "John J. Mearsheimer, Stephen M. Walt",
    "publisher": "Farrar, Straus and Giroux",
    "publishdate": "August 27, 2007",
    "isbn": "0374177724",
    "pages": "496",
    "dateread": "November 2009",
    "notes": "Just to start off, here is Will's stance on foreign policy: the less you try to change others the cheaper your relationships will be to maintain. This book supports the argument that there is a large and effective community of American voters who make Israel their first priority, and due to their influence, elected officials in America commit unconditional support to the country. Then the book goes on to explain how this is against America and Israel's best interests. In addition to the arguments that any libertarian or atheist would appreciate, the book responds to the question \"is Israel an asset or liability to America\". Mearsheimer enumerates instances where Israel has been of limited utility to the US when they wanted to use the state for military purposes if those purposes had not directly and immediately benefitted Israel. As to whether terrorist sentiment towards the US is related to America's support of Israel, the book refers the reader to a letter from Ramzi Yousef to the New York Times after he bombed the World Trade Center: \"We declare our responsibility for the explosion on the mentioned building. This action was done in response for the American political, economical, and military support to Israel, the state of terrorism, and to the rest of the dictator countries in the region.\" [Will's note] here is a related quote from Osama Bin Laden on Sept. 14, 2009 titled \"A statement to the American people:\" \"The reason for our dispute with you is your support for your ally Israel, occupying our land in Palestine.\" -- The book makes a poor case for quantifying the cost in dollars of America's direct support for Israel. After such a powerful book and argument, I was disappointed to lay eyes on a modern topic involving a price tag of only a few billions of dollars. For the future, I would like recommendations on counter arguments to this book, preferably matching this book point for point."
  },
  {
    "title": "Open Business Models: How to Thrive in the New Innovation Landscape",
    "author": "Henry Chesbrough",
    "publisher": "Harvard Business Press",
    "publishdate": "December 6, 2006",
    "isbn": "1422104273",
    "pages": "256",
    "dateread": "January 2009",
    "notes": "If you are not a C-level executive at a Fortune 200 company and you don't have one in your phonebook, this book is probably not relevant to you. This is a wonkish book that talks in theoretical terms about how intellectual property and trade secrets can be used internally or transferred outside the company."
  },
  {
    "title": "One Second After",
    "author": "William R. Forstchen",
    "publisher": "Forge Books",
    "publishdate": "March 2009",
    "isbn": "0765327252",
    "pages": "352",
    "dateread": "April 2010",
    "notes": ""
  },
  {
    "title": "The Big Short: Inside the Doomsday Machine",
    "author": "Michael Lewis",
    "publisher": "W. W. Norton & Company; Reprint edition",
    "publishdate": "February 2010",
    "isbn": "0393338827",
    "pages": "320",
    "dateread": "October 2010",
    "notes": "This was a recommendation when I was interviewing to work at CDI. It is an in depth look at the players in the mortgage-backed securities madness happening in the 2000's. More reading: Munger. The Psychology of Human Misjudgment; Grant's Interest Rate Observer. Michael Burry's letters to shareholders. Funds that shorted MBS: Whitebox, The Baupost, Passport Capital, Elm Ridge, Elliott Assoc., Cedar Hill Capital Partners, QVT Financial, Philip Falcone Harbinger Capital"
  },
  {
    "title": "168 Hours: You Have More Time Than You Think",
    "author": "Laura Vanderkam",
    "publisher": "Portfolio",
    "publishdate": "May 27, 2010",
    "isbn": "1591843316",
    "pages": "272",
    "dateread": "September 2010",
    "notes": "This is officially a time management / work-life balance book, but it tries to be more of a life/wasting time balance book. Be aware of the goals you have in life and find some 10 and 30-minute tasks that support those goals. Keep this task list handy and you'll naturally spend less time chit-chatting and watching TV. Nothing in this book is crazy useful for me or expands beyond what David Allen already made obvious, but it does touch on my general interest in post industrial revolution and post internet age anthropology/sociology. Specifically, how does human life change when productivity increases so that every one can eat and have shelter with only 3% of the population employed to enable this? This book in question points to a great quote in 1959 Harvard Business Review, \"boredom, which used to bother only aristocrats [will] become a common curse,\" and then tries to argue this is not the case. Chapter six does give more hard numbers and anecdotes from various sources to show how life has changed over the past 50 years. The most noticeable being a drastic reduction (~40%) in time spent cleaning/tending the house leading to more time at work and with the kids. Google for Good Housekeeping 1960 and just look for yourself."
  },
  {
    "title": "The Theory of Blackjack",
    "author": "Peter A. Griffin",
    "publisher": "Huntington Press",
    "publishdate": "February 1999",
    "isbn": "0929712137",
    "pages": "270",
    "dateread": "January 2011",
    "notes": "This is part of my research into blackjack. If you know me personally, you know about the analysis I'm doing right now. This book is a detailed analysis of point systems for blackjack and it investigates the efficiency of these systems in terms of the trade offs that are made to make each system simple for humans. I met Mike Aponte at some Drexel event in early 2011. He said this book and some shuffle tracking books are the latest books on the subject."
  },
  {
    "title": "Atlas Shrugged",
    "author": "Ayn Rand",
    "publisher": "Penguin",
    "publishdate": "1957",
    "isbn": "0452011876",
    "pages": "1168",
    "dateread": "June 2011",
    "notes": "This is another win for fiction books, it's a political \"thriller\" that shows the Unites States falling into rule as a people's state. The righteous industrialists stage a strike and hide from society, letting the iron fist rule the sheep, neither being having any productive capacity. Very interesting and there is a 60-page speech near the end where the leader of the strike addresses the public and explains the moral system of capitalism. And, he goes on to compare rule of a people's state to propogation of religion! There's lots of quotable stuff in here. (And when I say quotable, I'm talking about phrases and thoughts you can use in your own arguments some day.)"
  },
  {
    "title": "Producing Open Source Software: How to Run a Successful Free Software Project",
    "author": "Karl Fogel",
    "publisher": "O'Reilly",
    "publishdate": "October 14, 2005",
    "isbn": "0596007590",
    "pages": "304",
    "dateread": "December 2011",
    "notes": "This book's target audience is someone being hired to come and lead a thriving open source project who has no experience in the matter... a little odd. It discusses all the aspects of leading an international volunteer organization with people you will never meet face to face, from facilitating technical discussion, avoiding conflicts and delegating responsibility. There is a thorough discussion of technical options for hosting and SCM, which is useless because you would know all that before picking up this book. Either way, anyone in the profession should be able to pick this book up and find /something/ that could improve how they are working today. And for that, 4 stars."
  },
  {
    "title": "Assholes Finish First",
    "author": "Tucker Max",
    "publisher": "Gallery",
    "publishdate": "October 18, 2011",
    "isbn": "1439198691",
    "pages": "432",
    "dateread": "January 2012",
    "notes": "Funny shit."
  },
  {
    "title": "The Survivors Club: The Secrets and Science that Could Save Your Life",
    "author": "Ben Sherwood",
    "publisher": "Grand Central Publishing",
    "publishdate": "January 26, 2009",
    "isbn": "0446580244",
    "pages": "400",
    "dateread": "January 2012",
    "notes": "This book flows like a loosely connected series of Reader's Digest articles on people that have suffered great adversity. Some nuggets add value to the book and can make it hard to put down. Go buy the FM 21-76 Army Survival Manual, and get the most current, militarized version you have access to. A theme in there and the book in question is that the will to live exceeds the value of any other survival tactic."
  },
  {
    "title": "三国演义 Romance of the Three Kingdoms",
    "author": "罗贯中",
    "publisher": "湖南少儿出版社",
    "publishdate": "January 1, 2009",
    "isbn": "9787535841506",
    "pages": "247",
    "dateread": "June 2011",
    "notes": "This is one of the \"big four\" Chinese classical books told for thousands of years and finally written down around CE 1400 into a 24-volume story. The full edition includes maps and supplemental biographical summary. Luckily, I found the kid's version in a slick 250 pages (also with map and bio summary). This book is the basis for 三国杀, which is the game I played to learn Chinese and achieve my 15 minutes of fame so early in life. Ok, so the story... this book focuses solely on the rulers of the three kingdoms and their attempts to attack each other. All romance is strictly left out for want for brevity. A great read for anyone who plays the card game because the game's characters faithfully match the story's likeness and behaviors."
  },
  {
    "title": "Steve Jobs",
    "author": "Walter Isaacson",
    "publisher": "Simon & Schuster",
    "publishdate": "October 2011",
    "isbn": "1451648537",
    "pages": "656",
    "dateread": "February 2012",
    "notes": "Any Apple fan will enjoy this recollection of 30 years from PARC to \"Not. Fucking. Blue. Enough.\" to the post-PC world. The story of Steve goes through LSD, Buddhism, corporate life, and his personality, and how they contributed to his very successful products. The story somewhat comes full circle. In 1984, the launch of the Macintosh was pinned on escaping the world of IBM, boring, ubiquitous products, and \"big brother\". In 2014, while never boring, Apple is the ubiquitous player, and the public is learning how government and big corporations cooperate in sharing their supposedly private information. The time is ripe for a new Apple. Reading the story makes me think of all the other inspired industrial designers that weren't lucky enough to work in technology and computers, the hottest industry from 1980 to 2010."
  },
  {
    "title": "The Primal Blueprint: Reprogram your genes for effortless weight loss, vibrant health, and boundless energy",
    "author": "Mark Sisson",
    "publisher": "Primal Nutrition, Inc",
    "publishdate": "January 14, 2012",
    "isbn": "0982207786",
    "pages": "360",
    "dateread": "April 2012",
    "notes": "The main argument is: human diet and activities have changed much recently compared to our tried and true upbringings since divergence from the apes (~6m yrs ago) and obesity, lethargy, and other ailments have ensued. Recent dietary changes include popularization of agriculture/grains (10k yrs ago), plant engineering (2k yrs ago), added sugar craze (100 yrs ago), genetics/pesticides/hormones/antibiotics/artificials (60 yrs ago), increased transportation/shelf life of food (30 yrs ago). Recent changes in activity include popularization of not having hunt for food (12,000 yrs ago), machines/bikes/cars (200 yrs ago), TV (60 yrs ago), anti-sunlight/anti-social machines (20 yrs ago). Obviously all these things are working against our health and the book gives you lists of changes to go back to primal living and avoid modern ailments like diabetes, obesity, and fatigue. I think the real arguments to be had are \"do the internet, soda, and all this fake food really cause the modern whole new category of diabetes?\" and \"how many humans would fit on Earth if we were all eating real food like plants and animals?\""
  },
  {
    "title": "The Rise of Theodore Roosevelt",
    "author": "Edmund Morris",
    "publisher": "Random House",
    "publishdate": "November 23, 2010",
    "isbn": "1400069653",
    "pages": "960",
    "dateread": "November 2012",
    "notes": "With the limitation of having sources and notes for all facts in the book, Morris does a remarkable job of turning Teddy Roosevelt's life, from a pile of correspondence, diaries, and errata, into a lively story. He has no problem pulling in geographical and weather facts as they add color, including detailed description of a weather event that is a turning point in TR's life -- which was written as a perfectly executed interlude. Teddy is the man's man with hunting, travel, taxonomy and cowboy stories and there are great nuggets of insult \"[they're a] bunch of shrill eunuchs,\" \"[they are] logical vegetarians of the flabbiest type,\" \"they never open their mouths without subtracting from the sum of human knowledge,\" and in declining a funeral invitation of a political enemy, \"but that does not mean to say I do not heartily approve of it.\" \nThis is a volume on TR's life before presidency and it touches on the events that shaped his attitude, a father that gave quick and certain punishment for \"selfishness or cruelty, idleness, cowardice, or untruthfulness\", family, accomplices. Aside from the meaty story of bravery, suave, physical feats, there are plenty of tricks and social techniques shown, the Russian negotiator (p243), how to call a bluff (p281), running the press (p502), playing both sides of the aisle (p524), kissing ass (p607). In addition to the story of a great republican, it was interesting to read a history of politics, showing for sure that certain parts of the fight never change."
  },
  {
    "title": "Antifragile: Things That Gain from Disorder",
    "author": "Nassim Nicholas Taleb",
    "publisher": "Random House",
    "publishdate": "November 27, 2012",
    "isbn": "1400067820",
    "pages": "544",
    "dateread": "January 2013",
    "notes": "Reading a Taleb book is like holding a conversation with someone with a blood-alcohol level in the sweet spot between being able to speak intelligibly and not being afraid to brag about themselves. He maintains this BAC meticulously throughout the book. Mother nature mercilessly destroys beings and species that are not fit to survive, so beings get stronger. In fact, the more they are tested the stronger they get. A clay pot doesn't get better; after so much testing it will break. The book categorizes things by whether they benefit from being shook up. It is quite roundabout for being \"just\" a definition of a concept. Throughout the book it is taking street smart concepts of trust and skin in the game and breaking down explanations for things that you basically know already but don't know how you know. Applying to the modern world, there are callouts of who are exploiting the innocent and how to avoid being a sucker in a world of sharks."
  },
  {
    "title": "God Created the Integers: The Mathematical Breakthroughs That Changed History",
    "author": "Stephen Hawking",
    "publisher": "Running Press",
    "publishdate": "October 4th 2005",
    "isbn": "0762419229",
    "pages": "1176",
    "dateread": "December 2013",
    "notes": "This volume chronicles progress in Mathematics through translations of original works over the past several thousand years. The book opens with Euclid and his work, \"The Elements, was the second best selling book of all time, surpassed only be the Bible\" and describing it (only) as a collection of past mathematical works. The similarity to Hawking's book is perhaps immodest. The original translations are included verbatim with introductions from Hawking. With time, these texts have gained notoriety however the translations have not been updated. I /hate/ seeing typos and errors in math texts and manuals. Unlike some other reviewers my goal was to read this book entirely and not wince. Cantor was interesting to read while remembering the \"refutations\" kids often have to him when starting their math learning. I think the best math book that could possibly be written would be a list of question atop blank pages where the reader is asked to solve progressively more difficult problems."
  },
  {
    "title": "You Are Now Less Dumb: How to Conquer Mob Mentality, How to Buy Happiness, and All the Other Ways to Outsmart Yourself",
    "author": "David McRaney",
    "publisher": "Gotham",
    "publishdate": "July 30, 2013",
    "isbn": "1592408052",
    "pages": "288",
    "dateread": "February 2014",
    "notes": "This is a popular science psychology book comparing the scientific-method correct way of making decisions versus the shortcuts that the human mind makes. This is just a drawn-out and illustrated repeat of Charlie Munger's Psychology of Human Misjudgment. I like how both books use the term \"limited programming space\" to describe the shortcuts the brain takes. A few original thought in here that were interesting: \"Memories ... decay. Each time you recall [them], the event is reformed in your mind anew and differently, influenced by your current condition ...\" And some good facts are cited like parole judges have a 3x increase in favorable outcomes for defendants if rulings are made right after lunch, and excitement/arousal from circumstances can easily be misattributed to nearby people."
  },
  {
    "title": "Duty: Memoirs of A Secretary at War",
    "author": "Robert Gates",
    "publisher": "Knopf",
    "publishdate": "January 14, 2014",
    "isbn": "0307959473",
    "pages": "618",
    "dateread": "May 2014",
    "notes": "Robert Gates is a capable writer, able to easily take the storyline of his time as Secretary of Defense and separate it into themes each with their own timelines while maintaining a flow that helps illustrate the complexities of the role. Gates gives an interesting and close look into largest employer in the world by sharing senior tactical decisions used to support the mission. The many interactions discussed let you see how responsibility, accountability and military authorization are shared between bureaucrats and legislators and generals and lower officers. There is also a great amount of information and opinions about some our foreign relations with some friends (Russia?, Saudi Arabia, Israel?) and enemies (Pakistan). A close attention to timing and geography in the book, which includes many such details, versus the names and military ranks mentioned may even provide an unintentional disclosure of military capabilities of the US and other countries.\n Gates seems to take a reformer's attitude, while understanding that the legislature is required to make real change. While bemoaning lawmakers who vote on defense only to bring spending to their states, \"Congress is best viewed from a distance\". He carried out a \"'zero-based' review of all Defense intelligence missions, organizations, relationships, and contracts\" where each program should fight based on its own merits not because it already exists. However, he fails to present a zero-based strategy of US military involvement and instead defers to vague notions such as \"we cannot afford to lose\" or consequences will be huge like last time. His leadership of the CIA and experience with the Cold War and past US involvement in the Middle East is presented sparingly to help justify why the wars were maintained.\n For his first post-career memoir and for his level of experience, I was surprised to find a lack of candor in questioning the strategy and his uppers. For example, while specific senators are called out for defending wasteful in-state military spending (Patty Murray, Bill Young) he fails to discuss any perceived conflicts of interest from Dick Cheney favoring a pre-emptive first strike on Syria. Perhaps this is part of making sure the troops \"didn't do it for nothing\" that he asks of Bush's and Obama's speeches. I was also surprised in a lack of discussion of oil. I don't know anything about the influence of oil on the US's military decisions, but for a book over 600 pages focused on the middle east, it was interesting their major feature, oil, is mentioned only four times in passing. Another omission lies in this quote \"the [Iraq] war will always be tainted by the harsh reality that the public premise for invasion ... was wrong\" (p 569), emphasis on the word public.\n "
  },
  {
    "title": "Theodore Rex",
    "author": "Edmund Morris",
    "publisher": "Random House",
    "publishdate": "October 1, 2002",
    "isbn": "0812966007",
    "pages": "792",
    "dateread": "December 2014",
    "notes": "This second installment on Roosevelt's life focuses on his US presidency during the years 1901 to 1907. The story details the political feats of a president who succeeded in handling labor and combination domestic issues as well as successful negotiation of the Panama canal against an extorting local government. However, Morris' detailed account into Roosevelt's correspondence and relationships gives new themes and uses for the book. Diplomatic protocols, strategic personal correspondence (p. 692, to Alice), press relations, posterity letters, and personal ethics are all presented in such detail that you could use this book as a guide on each of these topics. Aside from political clout, it is interesting to look at Roosevelt as a man. His success in arbitrating the end of the Russo-Japanese War and the Coal Strike of 1902 were both attributed to his presidency; however, they were won both by the parties' testament to and reliance on Roosevelt's personal ethics. Overall it is great to learn more about this president with long-lasting impacts and a great understanding of naval strategy before America's rise from 5th largest naval fleet to first, especially in this year which will end the 100-year streak of America leading as the world's largest GDP (by PPP).\n "
  },
  {
    "title": "What If?: Serious Scientific Answers to Absurd Hypothetical Questions",
    "author": "Randall Munroe",
    "publisher": "Houghton Mifflin Harcourt",
    "publishdate": "September 2, 2014",
    "isbn": "0544272994",
    "pages": "320",
    "dateread": "January 2015",
    "notes": "This book is a collection of scientific articles playing out the absurd physical result of situations dreamed up by, mostly, fifth graders. A typical article includes a line like -- the pile of moles would be attracted by gravity into a sphere slightly larger than the moon with a surface gravity of one-sixteenth of Earth's, but this is where it starts to gets weird... This book immediately consumes all your available time until you have finished reading. And it rewards you with tidbits of information that would be useful in ridiculous situations as well as other information."
  },
  {
    "title": "Where Are the Customers' Yachts: or A Good Hard Look at Wall Street",
    "author": "Fred Schwed Jr",
    "publisher": "Wiley",
    "publishdate": "January 10, 2006",
    "isbn": "0471770892",
    "pages": "208",
    "dateread": "April 2015",
    "notes": "This is (yet) another story on the psychology and metaphysics of purchasing fractional interests in companies, told by focusing on different archetypes of players in the game. \"Yet another\" is harsh, because this was written in 1940 and even reminisces of a time before the SEC. Ignoring all the lessons and only comparing the descriptions of who's who versus today, it is interesting to see how little has changed in the investment/speculation business over the years. All this regardless of ever more regulation, Kelly criterion, modern portfolio theory, Black–Scholes, financial engineering, and much faster access to information. Charlie Munger might say: human intuition, save its self-defeatism, will produce better decisions than even tomorrow's financial theory.\n The major theme of the book is \"croupiers get paid, but everyone else on Wall Street is out to get themselves,\" coupled with \"nobody just wants to be the croupier.\" \n Over and over there are tales of greed and inflated self-worth conspiring to make people purchase risky assets on credit. This same description is used for most everybody. And quite simply the only constructive advice is to avoid buying on credit.\n "
  },
  {
    "title": "Hand to Mouth: Living in Bootstrap America",
    "author": "Linda Tirado",
    "publisher": "G.P. Putnam's Sons",
    "publishdate": "October 2, 2014",
    "isbn": "0399171983",
    "pages": "224",
    "dateread": "March 2015",
    "notes": "This book is a personal account of poverty and poor decisions and written in \"us vs them\" style to widen the chasm between \"rich\" people and \"poor\" people. It illustrates how a bad situation can easily beget more bad situations, and how lack of a well paying job can create a self-reinforcing bad lifestyle. This review started with one star but two specific stars were added. No attempt at a political solution to America's work problem was ventured. Thank you, just thank you. Reading carefully, it is an effective and enlightening story where you (anybody) can become the coveted \"rich\" person by avoiding certain pitfalls. \"Don't buy the toaster before you can afford bread,\" \"never tell off your boss,\" \"a rainy day fund is more important than anything.\" Reading the book this certain way makes it useful, just like reading some of Rich Dad Poor Dad.\n "
  },
  {
    "title": "Colonel Roosevelt",
    "author": "Edmund Morris",
    "publisher": "Random House",
    "publishdate": "October 18, 2011",
    "isbn": "0375757074",
    "pages": "784",
    "dateread": "July 2015",
    "notes": "This is the final part in Morris' trilogy depicting the life of Theodore Roosevelt. There are several angles from which to read this book: the story of a man, a historical timepiece, or a guidebook in high-level leadership. On the first two counts, this installment fails to live up to TR's earlier years. Spoilers abound: he travels and meets people, he doesn't get a third term, the progressive party fails to launch, we win the war after a late entry. Because of the fast onset of Roosevelt's political impotency, there is not much story you can hope for while reading. To consider the last angle, Morris' analysis and illustration always exhibit the insight and access that are necessary for high-level leadership. I'll touch on just two items here. Teddy has access to an extensive network of confidents which report to him popular sentiment and the official and unofficial working of countries across the world. He maintained this by extensive writing, and has perhaps \"written more than other man in the United States\" including 150,000 letters between 1898 and 1915. This access, and his insight, allowed Roosevelt to predict a war and really understand the direction of the countries in the world. Compared to nowadays, teenagers often have friends in other countries or at least people that they idolize or follow. And most today working in an office will send at least that many letters. With only insight, Twitter, and email, anybody is able to be as informed, prepared for the world, and able to understand the tensions in the world as Roosevelt did. Lastly Roosevelt's strong personal ethics are shown strong as ever throughout the book. A patriot signs himself and his sons up for war first. Use your energy propulsively. Read extensively and connect with them to grow knowledge together.\n "
  },
  {
    "title": "The Intelligent Investor: The Definitive Book on Value Investing",
    "author": "Benjamin Graham",
    "publisher": "HarperBusiness",
    "publishdate": "February 21, 2006",
    "isbn": "0060555661",
    "pages": "640",
    "dateread": "October 2015",
    "notes": "This book is required reading for value investing and includes detailed discussion on portfolio management, human discipline and stock selection. On portfolio management, Benjamin Graham recommends a minimum of 25% allocation in the asset class (equity or bonds) opposite of where you want to invest. In discipline, he says to consider the risk \"if there is a fair possibility that the holder may have to sell at a time when the price is well below cost.\" Since Graham's time, we now have access to myriad investment funds with neglegible fees supporting nearly any investment hypothesis. It is nearly certain that in today’s environment, Graham would recommend this investment plan for almost everyone.\nGraham gives active (\"enterprising\") stock pickers a plan to improve their stock returns by 5% before tax (p 34) versus indexes, but says this requires significant analysis. Don’t expect to make business profits (above market) from securities unless you have business-level knowledge of them. Napkin math says you need 10 years of your salary saved before this is worthwhile. And that was before your competition had calculators, let alone computers, high frequency trading and relaxed insider trading prosecution. But, you are probably reading this book because you want to beat the market or think you are special.\nGraham’s approach to analysis and valuation is interesting and useful — and it predates modern portfolio theory and the capital asset pricing model. Graham uses several metrics I have not seen in other modern textbooks including earnings/book (surprisingly resilient over the years), an emphasis on total capitalization in company ratios and showing annual stock prices as high/low ranges. With an investment horizon of 50 years, it is very appropriate to take a look at state-of-the-art analysis from about 50 years ago! Graham’s approach to accounting for warrants is to increase the market capitalization which in turn increases the price per share for common. \nAccording to Graham, good equity selection is a matter of finding a company with a strong financial position and the prospect for maintained future earnings which is priced close to its asset value and a safe multiple of earnings. Various litmus tests are provided for a strong financial position: a prominent brand with revenue somewhere near Fortune 500; 10+ years with no earnings deficit; 2+ current ratio; minimize over the past 10 years the maximum drop in EPS vs each's prior three years; long term debt less than equity at book (industrials) or less than 2x equity at book (utilities); 20+ years of continuous dividend payments; clear policy of 66% dividend payout ratio or demonstration that retained earnings increases per-share earnings. Also, there are tests for fair equity pricing: price less than net working capital minus debt (if possible); price less than earnings multiples of stocks with expected growth; price less than 1.33 times book value of equity. For bond selection, 7-year average earnings before tax divided by (fixed charge + 2x preferred) is recommended to exceed: 4+ (public utility), 5+ (railroad, retail), 7+ industrial.\nOverall, this has been a great starting point for someone interested in investing and stock selection. In modern times you must also consider pension liabilities and special purpose entities because they carry off-balance-sheet claims on future earnings. The additions in the revised edition by Zweig add 60% more text to the book and very little additional insight. \n ",
    "typo": "First found typo in Graham’s text was page 427, table 17-1. The times earned figure for 1967 is calculated wrong.\t \n "
  },
  {
    "title": "Audio Engineering 101: A Beginner's Guide to Music Production",
    "author": "Tim Dittmar",
    "publisher": "Focal Press",
    "publishdate": "December 5, 2011",
    "isbn": "0240819152",
    "pages": "256",
    "dateread": "December 2015",
    "notes": "This is a great book for learning about how a recording studio works. You are the aspiring intern that is learning the practical skills -- microphone selection, microphone placement, client engagement, basic mixing, musician communication -- that will make a recording session successful. Great strengths of this book include a vast dictionary of non-technical words that humans use to describe frequency ranges, frequency response diagrams for popular microphones and absorption coefficients for household materials. This book and YouTube video on wrapping a microphone cable are really enough to prepare you for your first day in the studio. There are even some higher level topics such as step-by-step instructions for a mixing section and answering \"how do I know when my mix is done?\" Many of the discussions on client interaction are directly applicable to photographers working on a portrait session.\n "
  },
  {
    "title": "Thing Explainer: Complicated Stuff in Simple Words",
    "author": "Randall Munroe",
    "publisher": "Houghton Mifflin Harcourt",
    "publishdate": "November 24, 2015",
    "isbn": "0544668251",
    "pages": "64",
    "dateread": "January 2016",
    "notes": "This is an oversized book full of illustrations and simple-language descriptions of various things. On many pages it is informative, explaining human cells, nuclear power generation and submarines. Some of the diagrams seem contrived and are perhaps only interesting to modern readers insofar as they are interested in the book's novel format -- various sports, skyscrapers and dishwashers / clothing washing machines. However, the biggest value of this book (which is alluded to several times in the text) is that it is a zeitgeist of the past few hundred years of human science achievements, all shown pictorially and with a small vocabulary of words. It is the perfect book for storing in a time capsule or sending into space.\t \n "
  },
  {
    "title": "Phishing for Phools: The Economics of Manipulation and Deception",
    "author": "George A. Akerlof, Robert J. Shiller",
    "publisher": "Princeton University Press",
    "publishdate": "September 22, 2015",
    "isbn": "0691168318",
    "pages": "288",
    "dateread": "February 2016",
    "notes": "This book falls into the sad category of economics books that are written for normal people and use invented words. True to form, it fails to make any noticeable contribution to economic thought. The main thesis of the book is that market economies incentivize products for poor decision makers. You know you are reading a terrible book when the afterword is dedicated to defending that its thesis even exists or is new, \"we will now describe three ways in which this book presents a perspective that is, quite possibly, novel relative to current economics.\" It also falls into the coulda/woulda/shoulda trap with \"had we economists appropriately seen free markets as a two-edged sword, we would all but surely have delved into the ways in which financial derivatives and mortgage-backed securities, and also sovereign debt, would turn out badly.\" Statements like this are useless, only with time machines is hindsight profitable. Foresight is valuable, it should only be necessary for the authors to tell us how much they bet and profited from these thoughts. As an adult, it was painful to read such an obvious analysis of the result when people with different motives come together. However, I do think this book would be a great study of critical thinking for children before the age of maturity."
  },
  {
    "title": "The Present as History: Essays and Reviews on Capitalism and Socialism",
    "author": "Paul M. Sweezy",
    "publisher": "Monthly Review Press",
    "publishdate": "1953",
    "isbn": "0853451400",
    "pages": "388",
    "dateread": "June 2016",
    "notes": "The 1950s in the United Status was an amazing time for political and social change, and it marked the the end of the last world war. This book collects essays written between 1920 and 1950 in an interesting format designed to make the case for socialism in the United States. Its author then went on to found The Monthly Review, the most successful socialist periodical in the United States till this day.\n\nAt that time, there was a notable chance of socialism taking hold in the United States and across the world. This comprised the Red Scare and included support from academics. I think the ideas in this book are very relevant to the United States and world relations in 2016, especially with the current topics in the presidential debates and with the advent of Brexit.\n\nThe way this book makes its point is very interesting. The author collects several recent published articles and adds a few of his own, then updates the wording for consistency. This is much better executed than the failure that was Stephen Wolfram's A New Kind of Science.\n\nOverall, I was very interested to understand the 1950s perspective on what is socialism. People use this word frequently in the US presidential debates and when discussing other countries but it is nice to go back to the original values and understand what the movement originally wanted. Perhaps the most valuable result of economic discourse is to compare societies and to understand their values."
  },
  {
    "title": "Sam Walton: Made In America",
    "author": "Sam Walton",
    "publisher": "Bantam",
    "publishdate": "June 1, 1993",
    "isbn": "0553562835",
    "pages": "368",
    "dateread": "March 2016",
    "notes": "Here is the quote that sums up the whole book. \"In retail, you are either operations driven -- where your main thrust is toward reducing expenses and improving efficiency -- or you are merchandise driven. The ones that are truly merchandise driven can always work to improving operations. But the ones that are operations driven tend to level off and begin to deteriorate.\" The story is littered with examples of brinksmanship purchasing and ridiculously successful marketing. But actually, it is very candid and open in discussing Sam's successful management approach. This approach involves ownership by individual store owners and very detailed coaching from top management. This level of involvement would require an entire level of district managers in other companies."
  },
  {
    "title": "It's Not How Good You Are, It's How Good You Want to Be",
    "author": "Paul Arden",
    "publisher": "Phaidon Press",
    "publishdate": "June 1, 2003",
    "isbn": "0714843377",
    "pages": "128",
    "dateread": "October 2016",
    "notes": "This is more of a scrapbook than a complete story. Maybe people use it as a toilet reader. I took it seriously. I put this book on the desk and read random one page a day. Then I try to work it in. That's just enough to make a dent in my life. Highly recommended."
  },
  {
    "title": "Style: Lessons in Clarity and Grace",
    "author": "Joseph M. Williams, Joseph Bizup",
    "publisher": "Pearson",
    "publishdate": "February 7, 2013",
    "isbn": "0321898680",
    "pages": "272",
    "dateread": "December 2016",
    "notes": "A great lesson in writing is required for anyone that has serious life aspirations. This book fills that appetite. It demonstrates principles of good communication, spanning from grammerly topics all the way to writing ethics. Unfortunately, writing in English also requires a style guide, so the most discerning grammarian will be unable to write by only consulting this book. However, this books does assist you in organizing your thoughts and making the day-to-day decisions of how to present yourself."
  },
  {
    "title": "The Psychology of Human Misjudgment",
    "author": "Charles T. Munger",
    "publisher": "N/A",
    "publishdate": "2005",
    "isbn": "N/A",
    "pages": "27",
    "dateread": "June 2017",
    "notes": "I have read this essay over and over. Charlie explores failings of the human mind that rooted in its limited programming space. Shortcuts in thinking and built-in behaviors are convenient and useful but they cause inaccurate reasoning. The essay reviews 25 perspectives on mental mistriggers that lead to misjudgment."
  },
  {
    "title": "Quiet Leadership",
    "author": "David Rock",
    "publisher": "Harper",
    "publishdate": "2007",
    "isbn": "978-0060835910",
    "pages": "250",
    "dateread": "September 2017",
    "notes": "I've read plenty of books about how to make computers pass the Turing test. This is the first to show humans how to fail it. The main prescription is that organizational leaders should leave all the thinking to their underlings. You pay people to think so you shouldn't do their job for them. Maybe it works. Overall the book is laid out like every other not-scientific book about business and psychology I've seen. There is a modern scientific explanation of something relevant to the book's main theme. Then there are piles of prescriptions that are based loosely on unattributed author experience. Then the prescriptions are summarized with mnemonics and graphics and 200 pages of repetitive text. And the examples read like the author is selling his personal consulting business. The boring format distracted me from the relatively simple message in the book."
  },
  {
    "title": "Value of Values",
    "author": "Swami Dayananda Saraswati",
    "publisher": "Arsha vidya Centre",
    "publishdate": "2007",
    "isbn": "978-8190363679",
    "pages": "148",
    "dateread": "November 2017",
    "notes": "This is my first book on Hindu studies, it is the introduction for learning Vedanta. Summary of Hindu understanding of the self: humans have body, mind and consciousness; body has needs; mind is limited; humans instinctively believe all three constitute the \"self\"; this motivates the consciousness to preserve the body. Once you understand that actually only consciousness is the self, then all of your subjective values become objective. This is book is an objective study of the values that you already knew. In other words, it is a reconstruction of the human value system using consciousness rather than intuition."
  },
  {
    "title": "Light! On light in life and the life in light",
    "author": "Olafur Eliasson, Tor Nørretranders",
    "publisher": "Forlaget Tor.dk",
    "publishdate": "December 13, 2015",
    "isbn": "978-8799615735",
    "pages": "200",
    "dateread": "January 2018",
    "notes": "This is a fun read that leaves you with more questions than answers. In the past 100 years, the amount and color frequencies of light that humans are exposed to has changed drastically. Humans are designed to respond to light and color in certain ways, so this is surely a topic worthy of inquiry. I was 90% expecting to find a foldable spectroscope in the back of the book and was disappointed to only find a picture of how to build your own with a CD and a shoebox."
  },
  {
    "title": "Exploring Vedanta",
    "author": "Swami Dayananda Saraswati",
    "publisher": "Arsha vidya Centre",
    "publishdate": "April 1, 2007",
    "isbn": "978-8190363648",
    "pages": "110",
    "dateread": "February 2018",
    "notes": "This is a metaphysics book, it concerns the subjective (conscious) self and the objective universe. Any meditation and learning about the self is knowledge (pure truth, cannot be improved). But any layers and levels (mithyā) of labels we use to describe the universe is necessarily an approximation, and further, void of any actual existence. Then the reduction is explained in full force! The pure way to understand the subjective self is that it excludes your physical body, the chemicals inside you and your thoughts — the same self is in the real world and in the dream world — and therefore it transcends both. This also means that consciousness is a unitary entity — and The Consciousness in you is the same that is in other people and things that have self awareness. Reduction also applies to the objective universe! Truly exists not your sensing of the world, nor the things in the world, nor the molecules, nor atoms, nor particles — existence applies in our universe as well as any possible universe — and therefore it transcends them. This means that existence is also a unitary entity — and The Existence in these particles the same that is everywhere a time and a space are involved."
  },
  {
    "title": "This Is Our Constitution: Discover America with a Gold Star Father",
    "author": "Khizr Khan",
    "publisher": "Knopf Books",
    "publishdate": "October 24, 2017",
    "isbn": "978-1524770914",
    "pages": "224",
    "dateread": "March 2018",
    "notes": "This book is a constructionist view of the beginnings of America. It starts with the motivation for starting a new country, the Declaration of Independence, and then proceeds through the Constitution. Basic ELI5 commentary is given for each article and amendment. This would make a great substitute for a child's civics class -- of course no child would take an interest in reading this book. The author makes very clear that his favorite amendment was the fourteenth. Upon closer inspection, I found the 'nor shall any State deprive' part applies to 'any person', and this is corroborated in 1 U.S. Code § 8. I did not previously know that the Constitution guaranteed rights to non-citizens. My understanding of world events makes me believe less in the Constitution's standing in this regard. And finally, I find the author's understanding of the tenth amendment very limited."
  },
  {
    "title": "An American Family: A Memoir of Hope and Sacrifice",
    "author": "Khizr Khan",
    "publisher": "Random House",
    "publishdate": "October 24, 2017",
    "isbn": "978-0399592492",
    "pages": "288",
    "dateread": "April 2018",
    "notes": "A love story, a patriotism story and the American dream. This book explains the values of one man who came to the states and started a new life -- and it chronicles the good of strangers who helped along the way. It is as much a primer on American culture as Muslim faith. "
  },
  {
    "title": "A Passion for Leadership",
    "author": "Robert Gates",
    "publisher": "Knopf",
    "publishdate": "January 10, 2017",
    "isbn": "978-0307949646",
    "pages": "256",
    "dateread": "June 2018",
    "notes": "This is on par with a Jack Welsh book. As far as the content and advice, it is a little too removed and third-persony. Being involved with so many situations and having a leadership role with vast expanse it is impossible to execute the position without having strong emotions and actual conflicts in some areas. Unfortunately, this book dances around sensitive topics. I would rather hear Gates' thoughts on matters of conflict than this generic top-down view. A Steve Jobs book with \"that guy was an asshole\", \"their products are shit\" candor would be much more valuable and helpful to anybody trying to learn something."
  },
  {
    "title": "Gordon Welchman: Bletchley Park's Architect of Ultra Intelligence",
    "author": "Joel Greenberg",
    "publisher": "Frontline Books",
    "publishdate": "May 19, 2014",
    "isbn": "978-1848327528",
    "pages": "288",
    "dateread": "May 2018",
    "notes": "This is a much better book about leadership. I always thought that leadership is only possible from people that are doers. This story of Welchman is a deeper look than the Hut Six story and gives a chronological and organizational explanation of how British codebreaking efforts helped defeat the Nazis. There is a great explanation of Enigma that really helps explain content in the main text -- read the appendix first!"
  },
  {
    "title": "Masters of Doom: How Two Guys Created an Empire and Transformed Pop Culture",
    "author": "David Kushner",
    "publisher": "Random House Trade Paperbacks",
    "publishdate": "May 11, 2004",
    "isbn": "978-0812972153",
    "pages": "368",
    "dateread": "August 2018",
    "notes": "This is a biography of two people and a game publishing company. They started from scratch and then created Quake, the greatest game of all time. Since nothing better could ever be achieved, the team disbanded and went in various directions. This is a good record for people that grew into computer and gaming subcultures in the 1990s. Maybe these are two of the few subcultures that turned into full cultures."
  },
  {
    "title": "Pimp: The Story of My Life",
    "author": "Iceberg Slim",
    "publisher": "Cash Money Content",
    "publishdate": "May 2011",
    "isbn": "978-1451617139",
    "pages": "368",
    "dateread": "June 2018",
    "notes": "The praise for Slim as the great \"black author\" or \"father of a genre\" comes from influential artists, notably in the hiphop world. This wasn't on my high school's required reading list (maybe it was, I didn't read books in high school), but this is clearly a classic. The storytelling is good. If the definition of storytelling is setting up expectations and then breaking those expectations then this story delivers because of how it introduces the characters and even the smaller characters have real depth which lead to conflicts. The book isn't contrived with added details to make it louder than necessary. // The story is about the fast life and some decisions that put the squeeze on Slim. Maybe pimping itself is less prevalent today since we have other ways to get the fix -- but I think human nature does not change, so it is interesting to see the unique people in this life and wonder what the same people would be doing if born in a different place and time."
  },
  {
    "title": "Honeybee Democracy",
    "author": "Thomas D. Seeley",
    "publisher": "Princeton Press",
    "publishdate": "2010",
    "isbn": "978-0691147215",
    "pages": "269",
    "dateread": "July 2018",
    "notes": "The colony has one queen and many workers. To survive, a colony needs to forage for food and find a suitable home among many local options then bring most of the bees there. This book cites past research and adds original research on this topic to explore how honeybees deal with these problems. Biology research in nature is the inspiration for all new drugs. Maybe sociology research in nature can inspire products and systems that require interconnectivity and collective decisionmaking. It seems like there is much more research to do in this field. I'd be interested to read more about attacks on the honeybees. Maybe other bee species deter honeybees from entering a potential site when there is competition. Maybe predators somehow attract honeybees. Or maybe in a place with limited nesting sites, a rival colony will infiltrate neighbors and trick them to selecting inferior sites, leaving the good ones for the spy colony."
  },
  {
    "title": "Trick Baby: The Story of a White Negro",
    "author": "Iceberg Slim",
    "publisher": "Cash Money Content",
    "publishdate": "September 13, 2011",
    "isbn": "978-1936399017",
    "pages": "320",
    "dateread": "November 2018",
    "notes": "First, this book is the 2011 Robert Beck Estate version. I saw some complaints that these are posthumous edits. I don't know how this compares to the original Trick Baby: The Biography of a Con Man (1967, Holloway House). This book comes in a slightly different style, and it is from a different voice, the voice of White Folks. But it uses Slim's literary devices (foreshadowing, word choice, detail level). The story is good and, dare I say, informative. I have seen some scams in life and it is interesting to see the other side of these stories. Of course this is just a small slice and there are a lot more stories to tell. I am seeing a theme between this book and the original Slim is substance abuse. It is interesting to compare where people pick up the habit, whether by themself or by introduction."
  },
  {
    "title": "The Definitive Guide to Scrum: The Rules of the Game",
    "author": "Ken Schwaber, Jeff Sutherland",
    "publisher": "none",
    "publishdate": "November 2017",
    "isbn": "none",
    "pages": "20",
    "dateread": "May 2019",
    "notes": "I need to post more direct-to-PDF publications on this list because some are just as good as books. And also the authors should start registering ISBN numbers for their publications because they are worthy. This book is a shared vocabulary for product-driven project management. If you can adopt this very portable naming scheme for your project stakeholders then it gives you, again very general, a way to manage the committments and progress reports within and between teams. Then add a few specific rules -- like don't allow anybody to unilaterally make committments on the team until the next progress report iteration, and workers must regularly forecast if their committed work will be complete by progress report day instead of waiting until that day. Now you have a very usable team dynamic, which is roughly implemented in all modern product development teams. By using the same framework, even across product types, we can now easily describe these processes and learn together."
  },
  {
    "title": "How JavaScript Works",
    "author": "Douglas Crockford",
    "publisher": "Virgule-Solidus",
    "publishdate": "October 18, 2018",
    "isbn": "1949815005",
    "pages": "279",
    "dateread": "May 2019",
    "notes": "The book was fun and explored some of the way you should be using JavaScript rather than how JavaScript works. A key topic of the book is to lament certain JavaScript features which then culminates in the definition of a new educational language which transpiles into a subset of JavaScript. I would have been more interested in a call-to-arms which invited participation and hoped to actually produce solve the identified problems. The book recommends reading other people's code as a way to learn -- good advice. In general, the author eschews NPM, running other people's code without reading it, and fully documenting code; but surely he does not audit the JavaScript runtime, the operating system, or the processor running underneath. I purchased and read this book as a means to an ends and can post more about that later."
  },
  {
    "title": "The Art of Money Getting: Golden Rules for Making Money",
    "author": "P. T. Barnum",
    "publisher": "Unknown",
    "publishdate": "1880",
    "isbn": "NA",
    "pages": "82",
    "dateread": "March 2019",
    "notes": "This book is so valuable I almost want to keep it as a secret for my competitive edge. This has full examples, prescriptions and explanations on what men should to do to be prosperous in business. And it proves that any business book, unless it is including raw data, need not spam more than 100 pages."
  },
  {
    "title": "Mama Block Widow",
    "author": "Iceberg Slim",
    "publisher": "Cash Money Content",
    "publishdate": "May 2013",
    "isbn": "9781936399192",
    "pages": "244",
    "dateread": "June 2019",
    "notes": "This is the account of Otis Tilson, edited by Iceberg Slim, and then for some reason re-released by his estate 50 years later. The main theme is the effects of indentured servitude, sexual abuse and parenting on a child that never grows up. This is very periphrial to Slim's life and is surely successful mostly because of his name on the cover. Thiis is barely the Chicago underworld from Slim's other books."
  },
  {
    "title": "Berkshire Beyond Buffett",
    "author": "Lawrence A. Cunningham",
    "publisher": "Columbia Business School Publishing",
    "publishdate": "2014",
    "isbn": "9780231170048",
    "pages": "307",
    "dateread": "July 2019",
    "notes": "This was a present from Mandy, thanks Mandy. There's only so many stories in the history of Berkshire and Buffett so anybody following the topic is sure to sit through some reruns. This book adds to the conversation by introducing some original reporting -- notes from the managers of the Berkshire businesses -- and organizing what is known about Berkshire history into specific character values of the leader. This, The Seven Habits and How to Win Friends are as much help as anyone can get to developing their soft skills. Going forward, aside from the annual reports, probably the only other thing worth studying would be manager direct reports to Berkshire, manager salary negotiation letters and the acquisition offer letters and other interim communications. Values can be studied but behaviors can be emulated."
  },
  {
    "title": "The Effective Manager",
    "author": "Mark Horstman",
    "publisher": "Wiley",
    "publishdate": "July 5, 2016",
    "isbn": "978-1119244608",
    "pages": "208",
    "dateread": "August 2019",
    "notes": "Good book, clear prescriptions for behaviors managers can implement for managing people. This includes using different kinds of power to steer the behavior you are seeking, and helping the team grow. In school, you learn business administration and management science, but this is the missing book. Just spent $4k on conference tickets as part of this series, if that is a testament to the value of this book. The book could be improved by including a one-page tl;dr at top and reducing to 100 pages. I'm not sure why everybody thinks they need to publish 200 pages for something to count as a book."
  },
  {
    "title": "Permanent Record",
    "author": "Edward Snowden",
    "publisher": "Metropolitan Books",
    "publishdate": "September 17, 2019",
    "isbn": "978-1250237231",
    "pages": "352",
    "dateread": "October 2019",
    "notes": "This is Snowden's own account of his life and his whistleblowing. There is much to say on whether he did the right thing and I have a whole blogging website about privacy, but that's a discussion, here this is just a book review. Snowden explains how and why the U.S. government hacks/infiltrates/coerces U.S. technology providers to provide full access to all details/papers/effects of every American's life and keeps it permanently (among other things). ETHICS. Whenever a person takes big and new action which is guided by their morals, we like to read about the origin and development of these morals, it tests us. This book mostly delivers — Snowden the character is developed and we can see how love of the U.S. constitution and a sense of duty to the people, mixed with opportunity, delivered his outcome. Soldiers risk life and limb to protect the American people, so while reading this book you need to ask would they or you do like Snowden did if you had the chance? The book explains most of the ethics and background for you to relate and answer this question. One part that is missing — and I know this sounds stupid — is the explanation of why he bothered to pick up and read the constitution in the first place. Not everybody is civic-minded, and not everybody understands change, idealism and opposition to authority. True patriotism is more than identifying your team and wearing the team colors, it requires knowing and loving your country so well that you would recognize it at another place and time. These explanations are missing and so the full ethical story might be inaccessible to some people. TECHNOLOGY. The book explains enough for anybody to understand what happened and the systems and parts that worked together to do it. STYLE. The prose is mostly open and matter-of-fact. Even at times a fact is included or a tangent is presented at the expense of an important point being made. These informalities make the text relatable. At other times, the text reads slightly guarded. Words are carefully chosen \"I could have,\" or \"I would have\" versus \"I did.\" Don't break the law when you're breaking the law. Confessing to any other crimes may have detracted from the main message, but the guardedness is visible. CALLS TO ACTION. Reading a book is an investment and if it doesn't change your life it's a loss. Maybe the actions we can take reading this book are to relate to geeky technology people, or approve Snowden's actions, or refine our own ethics, or reform governments everywhere, or contribute to the next generation of tools he is developing for privacy. Maybe the most alarming statament he made is that he could access the personal emails and more of the justices of the U.S. supreme court without a warrant. That is a very specific claim aimed at a very specific, and small group of people. You need a bigger scandal to make the public react. As Snowden himself says, it is not enough to lay out the facts; you must stick around to help your audience with interpreting them. Also he could have been more specific about asking for others to support his cause. While calling out Bush and Obama, with repeats, for supporting unconstitutional surveilance and other crimes, he fails to make a specific case for 45 to take action. And he also fails to make the case for a specific whistleblower, someone that has a specific access he does not. Somebody has access to the search logs and knows whether an agent did in fact access supreme court justice private information, or tap attorney-client priviledged communications for a defendant against a federal prosecution, or whether a specific group of people, say blacks, or civil rights proponents, were targeted for parallel construction of minor drug offenses. Snowden could have explained his ethics up-front on whether the person who does have access to that information should make it public."
  },
  {
    "title": "The Gift of Fear",
    "author": "Gavin de Becker",
    "publisher": "Dell",
    "publishdate": "May 11, 1999",
    "isbn": "978-0440508830",
    "pages": "384",
    "dateread": "January 2020",
    "notes": "This book has a lot of self-promotion for the author's own business. In Philadelphia, we have special name for somebody that does this. Read past all that. The main thesis in this book is: Your body is hard-wired for incredible feats of strength and triggered when your livelyhood is at risk, likewise your mind is hard-wired for increadible feats of intuition and triggered when your livelihood is at risk. We call this intuition \"fear\" and it can be opaque -- the thing you seem to fear might not actually be the thing you are avoiding. Great examples abound of how to introspect this fear and refine it. The context of the book is how to avoid being a victim of violence."
  },
  {
    "title": "The Naked Soul of Iceberg Slim",
    "author": "Iceberg Slim",
    "publisher": "Canongate Books",
    "publishdate": "2012",
    "isbn": "978-0857869685",
    "pages": "248",
    "dateread": "January 2020",
    "notes": "This seems to be the final book from Slim. These are the extra people and stories from his life. But also as an OG, he reaches out to interview Black community leaders and give a 1970s perspective of race relations in America. Maybe this has been covered by other historians but coming from Slim, he is probably the most credible source. Compared to his past stories that talk about race wars as specific people doing specific bad things, in this book the volume increased to \"everybody is thinking it whether or not they have acted out yet.\" This is a sad and more cynical view of the world."
  },
  {
    "title": "No Surrender: My Thirty-Year War",
    "author": "Hiroo Onoda",
    "publisher": "Naval Institute Press",
    "publishdate": "October 1999",
    "isbn": "978-1557506634",
    "pages": "224",
    "dateread": "February 2020",
    "notes": "There are quite a few ways to read this book: a military history adventure, a wilderness survival guide, subversion tactics against a well-funded enemy, a reminder on the importance of protocols in dealing over a weak communications channel. But, the most basic story is the honor and perseverence of a man which propells him to execute the entire World War II Axis resistance for decades with his own two hands."
  },
  {
    "title": "User Friendly: How the Hidden Rules of Design Are Changing the Way We Live, Work, and Play",
    "author": "Cliff Kuang, Robert Fabricant, Jean Ann Douglass",
    "publisher": "MCD",
    "publishdate": "November 19, 2019",
    "isbn": "978-0374279752",
    "pages": "416",
    "dateread": "April 2020",
    "notes": "The first hundred pages pushed through personal stories of people from long before I was born, doing things that do not affect how I live, work and play. After that, things got much better and several case studies are worked through to illustrate how humans bring their own experiences to help how to learn products they interact with, products you are designing. Then great examples come in and towards the end, several nuggets of tools are introduced to help designers close the loop with users to understand them better and make improvements."
  },
  {
    "title": "Ultimate Guide to Link Building: How to Build Backlinks, Authority and Credibility for Your Website, and Increase Click Traffic and Search Ranking",
    "author": "Eric Ward, Garrett French",
    "publisher": "Entrepreneur Press",
    "publishdate": "April 5, 2013",
    "isbn": "978-1599184425",
    "pages": "304",
    "dateread": "June 2020",
    "notes": "This is a sourcebook for different approaches to link building. For beginners or experts, it might give you some ideas starting or updating your next campaign, but it is far from a full education on the topic. For the next edition I would like to see better organization (here it is organized by who wrote each word if at all) and more of a guide. Some content is severly dated like mentioning Better Business Bureau -- they have been 10 year irrelevant even 10 years ago, also many links are broken from in the book and on the associated pages. I would be much more interested in reading more actual email campaigns that worked and ones that didn't. Also, I'd like to see metrics -- how can I tell what a good campaign looks like in terms of resources spend and outcomes achieved. Show examples, don't be theoretical. I am planning to create such a guide for internal training based on our team's results."
  },
  {
    "title": "The Selfish Gene",
    "author": "Richard Dawkins",
    "publisher": "Oxford University Press",
    "publishdate": "2006",
    "isbn": "978-0199291151",
    "pages": "360",
    "dateread": "January 2006",
    "notes": "This book extends the concept of Darwin's natural selection from individual secies and organisms to ideas."
  },
  {
    "title": "A Discourse on Inequality",
    "author": "Jean-Jacques Rousseau",
    "publisher": "Penguin Press",
    "publishdate": "January 1984",
    "isbn": "978-0140444391",
    "pages": "188",
    "dateread": "Jan 2005",
    "notes": "For sure this is required reading for any ethics class."
  },
  {
    "title": "Understanding Audio and Video",
    "author": "Michael Riggs",
    "publisher": "Pioneer Electronics",
    "publishdate": "Jan 1989",
    "isbn": "0-87455-232-x",
    "pages": "180",
    "dateread": "Jan 1994",
    "notes": "This book was published by Pioneer as a guide or manual for setting up and understanding televisions and other electronics in your family room. I probably picked this up from Radio Shack or Silo. It goes through basic details for equipment in your house and how it works, like the difference between AM and FM radio, how a radio tunes into a frequency, and what the difference is between wiring your speakers in parallel versus series. The best part is that you can take apart the TVs and turntables in your house and see that they basically look as described in the book."
  },
  {
    "title": "The Theory of Relativity: And Other Essays",
    "author": "Albert Einstein",
    "publisher": "Citadel Press",
    "publishdate": "Jan 1950",
    "isbn": "97808095517650",
    "pages": "73",
    "dateread": "Jan 2006",
    "notes": "These essays from Einstein are all rooted in common sense and contain basically no math. Everyone taking undergrad physics should read this brief book."
  },
  {
    "title": "The Age of Spiritual Machines: When Computers Exceed Human Intelligence",
    "author": "Ray Kurzweil",
    "publisher": "Penguin Press",
    "publishdate": "Jan 2000",
    "isbn": "9780140282023",
    "pages": "388",
    "dateread": "Jan 2002",
    "notes": "Skip straight to the timeline at the end, that is the interesting take on technology and humans working together."
  },
  {
    "title": "The Blind Watchmaker: Why The Evidence of Evolution Reveals A Universe Without Design",
    "author": "Richard Dawkins",
    "publisher": "Norton",
    "publishdate": "Jan 2006",
    "isbn": "9780140282023",
    "pages": "388",
    "dateread": "Jun 2006",
    "notes": "This book is the great practical explanation for Darwin's Theory of Evolution."
  },
  {
    "title": "The Prince",
    "author": "Niccolo Machiavelli",
    "publisher": "Bantam Classics",
    "publishdate": "September 1, 1984",
    "isbn": "978-0553212785",
    "pages": "166",
    "dateread": "October 2007",
    "notes": "Maybe diplomacy was more straightforward when your allies and neighbors were physically close by and you could only maintain as many relations with states as you could send horses to get to. This book is the guide for stately diplomacy - choosing alliances and commiting to your allies -- as well as all domestic affairs. It is short enough that it could be applied generally, outside of just affairs of a government."
  },
  {
    "title": "Night Train to Sugar Hill",
    "author": "Iceberg Slim",
    "publisher": "Contra Mundum Press",
    "publishdate": "August 4, 2019",
    "isbn": "978-1940625294",
    "pages": "324",
    "dateread": "July 2020",
    "notes": "Published almost 30 years after the 'author's death, this book is clearly in a different voice than other books from Slim. This is clearly the worst book in the series."
  },
  {
    "title": "Getting Things Done",
    "author": "David Allen",
    "publisher": "Penguin",
    "publishdate": "2001",
    "isbn": "978-0142000281",
    "pages": "263",
    "dateread": "Jan 2008",
    "notes": "This is the source reference for most productivity software and websites. When Google is making your email client or someone is making your project management software for your phone... those people read this book and are trying to bring that philosophy to you. The main discipline in this book is: when you are in triage mode, everything less than 2 minutes of work gets done now and everything else goes into a system, and each thing only touches your triage mode once. In this millennium, we have from to a stream of email (that's old) to a deluge of text messages and Slack messages, and most people I know now don't even notice or care what is in their email. So one important modern discipline is missing from this book: keep good relationships with your contacts and set standards with them about what channels they should reach you at regarding actionable items."
  },
  {
    "title": "The One Thing: The Surprisingly Simple Truth Behing Extraordinary Results",
    "author": "Gery Keller, Jay Papasan",
    "publisher": "Bard Press",
    "publishdate": "2012",
    "isbn": "978-1885167774",
    "pages": "240",
    "dateread": "July 2020",
    "notes": "I'm not sure how this book gamed the Wall Street Journal's best seller list, but as a reader, your best bet is now to ignore that list entirely. The good parts of this book are the UV gloss overlay on the dust cover, extra bright white paper and use of two colors in text. Now to the bad parts -- the words in the book, the lack of a references or notes section (we've researched \"[thousands] of scholarly articles...\" see it on our website), and then their website which of course is yet another subscription service."
    },
    {
      "title": "Exercise of Power: American Failures, Successes, and a New Path Forward in the Post-Cold War World",
      "author": "Robert M. Gates",
      "publisher": "Random House",
      "publishdate": "June 16, 2020",
      "isbn": "978-1524731885",
      "pages": "464",
      "dateread": "September 2020",
      "notes": "Gates opens up by lamenting how US presidents are quick to rely the military as their primary instrument of power when they want to exert influence outside their country. Then examples are developed on a country-by-country/region basis, across post-cold-war presidents on how they have balanced military and non-military instruments of power. He is authoritative on the topic and this surely brings a great study of the past for future executive leaders. Each example lays out how the conflict played out and how we might rebalance to have non-military initiatives play a primary role in reaching out objectives. In other words, it is \"defund the police\" on an international level. After circling around the rest of the globe, he lands on China where he simply details their strengths and shows how those will prove to be an enduring advantage over the organization of the US government. This was a big change in the tone of the book because the former examples show countries that we walked into and had a commanding success as per our objectives, or could have if policy was better decided. But for the latter, it shows that we zero advantages or leverage in securing our interests."
    }
]
